openfoam-amd/benchmarks/basecase/Allmesh_serial
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# copy motorbike surface from resources directory
cp $FOAM_TUTORIALS/resources/geometry/motorBike.obj.gz constant/triSurface/
runApplication surfaceFeatureExtract

runApplication blockMesh

runApplication decomposePar
runApplication snappyHexMesh -overwrite

#- For non-parallel running
rm -rf 0
cp -r 0.orig 0 > /dev/null 2>&1

#- For parallel running
#ls -d processor* | xargs -I {} rm -rf ./{}/0
#ls -d processor* | xargs -I {} cp -r 0.orig ./{}/0

#------------------------------------------------------------------------------
